tap "benwebber/tunnelblickctl"
tap "eth-p/software"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mazerte/software"
tap "sambadevi/powerlevel9k"
tap "weaveworks/tap"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Text processing system for reStructuredText
brew "docutils"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Official Amazon AWS command-line interface
brew "awscli@1"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib", link: false
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git Remote Helper to interact with AWS CodeCommit
brew "git-remote-codecommit"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# XML security library
brew "libxmlsec1"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Tool to build, change, and version infrastructure
brew "terraform"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# YAML syntax highlighter to bring colours where only jq could
brew "yh"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for Tunnelblick
brew "benwebber/tunnelblickctl/tunnelblickctl"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Colorize your kubectl output
brew "hidetatz/tap/kubecolor"
# Open the AWS console with your CLI credentials where your needed to be!
brew "mazerte/software/aws-console"
# Easy CLI to create and manage vpn connection to your AWS VPC
brew "mazerte/software/aws-vpn"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred4"
# Electronics prototyping platform
cask "arduino"
# Electronics prototyping platform
cask "arduino-ide"
# HDR photo editor with filters, batch processing and more
cask "aurora-hdr"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# Web debugging Proxy application
cask "charles"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Enhance your RAW files to open up even more possibilities with Adobe Photoshop and Lightroom®
cask "dxo-pureraw"
# Control your Elgato key lights
cask "elgato-control-center"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Fujitsu ScanSnap Scanner software
cask "fujitsu-scansnap-home"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# GPS log file viewer and analyzer
cask "gpxsee"
# Open-source video transcoder
cask "handbrake"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# AI photo editing. Awesome. Faster.
cask "luminar-ai"
# File system integration
cask "macfuse"
# Video format converter (transcoder)
cask "makemkv"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# French TV streaming service
cask "molotov"
cask "mysides"
# Open-source software for live streaming and screen recording
cask "obs"
# Cull 1000 photos in 60 seconds.
cask "optyx"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# GUI for streamlined Redis application development
cask "redisinsight"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# DBMS-independent SQL query tool
cask "sqlworkbenchj"
# System monitor for the menu bar
cask "stats"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Avenue", id: 1523681067
mas "DaVinci Resolve", id: 571213070
mas "Disk Speed Test", id: 425264550
mas "GIPHY CAPTURE", id: 668208984
mas "Home Assistant", id: 1099568401
mas "Reeder", id: 1449412482
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "TeleprompterPAD", id: 1507218595
mas "Xcode", id: 497799835
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "esphome.esphome-vscode"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gurumukhi.selected-lines-count"
vscode "hashicorp.terraform"
vscode "johnpapa.vscode-peacock"
vscode "keesschollaart.vscode-home-assistant"
vscode "kj.sqltools-driver-redshift"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "orta.vscode-jest"
vscode "pranaygp.vscode-css-peek"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
