tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "benwebber/tunnelblickctl"
tap "eth-p/software"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mazerte/software"
tap "sambadevi/powerlevel9k"
tap "weaveworks/tap"
# Shell plugin manager
brew "antibody"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Command-line interface for SQLite
brew "sqlite"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Official Amazon AWS command-line interface
brew "awscli@1"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Git Remote Helper to interact with AWS CodeCommit
brew "git-remote-codecommit"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# X.509 and CMS library
brew "libksba"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Safe, concurrent, practical language
brew "rust"
# Tool to build, change, and version infrastructure
brew "terraform"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# YAML syntax highlighter to bring colours where only jq could
brew "yh"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Isengard-cli command line interface to Isengard
brew "amazon/amazon/isengard-cli"
# Command-line interface for Tunnelblick
brew "benwebber/tunnelblickctl/tunnelblickctl"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Open the AWS console with your CLI credentials where your needed to be!
brew "mazerte/software/aws-console"
# Easy CLI to create and manage vpn connection to your AWS VPC
brew "mazerte/software/aws-vpn"
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# HDR photo editor with filters, batch processing and more
cask "aurora-hdr"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion360"
# Menu bar icon organizer
cask "bartender"
# Web debugging Proxy application
cask "charles"
# Bitfocus Companion enables the reasonably priced Elgato Streamdeck to be a professional shotbox surface for an increasing amount of different presentation switchers, video playback software and broadcast equipment.
cask "companion"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Enhance your RAW files to open up even more possibilities with Adobe Photoshop and Lightroom®
cask "dxo-pureraw"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Open-source video transcoder
cask "handbrake"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Software for Logitech devices
cask "logitech-options"
# AI photo editing. Awesome. Faster.
cask "luminar-ai"
# File system integration
cask "macfuse"
# Video format converter (transcoder)
cask "makemkv"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
cask "mysides"
# Cull 1000 photos in 60 seconds.
cask "optyx"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Unleash your creative genius and make waves across Twitch and YouTube.
cask "stream-deck"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "GIPHY CAPTURE", id: 668208984
mas "Home Assistant", id: 1099568401
mas "Reeder", id: 1449412482
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "Snappy", id: 512617038
mas "Xcode", id: 497799835
